app/controllers/projects_controller.rb

    def index
        @projects = current_user.projects.reorder("id DESC").paginate(page: params[:page], per_page: 5)
---
SELECT  "projects".* FROM "projects" INNER JOIN "projects_users" ON "projects"."id" = "projects_users"."project_id" WHERE "projects_users"."user_id" = $1 ORDER BY id DESC LIMIT $2 OFFSET $3  [["user_id", 2], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "projects" INNER JOIN "projects_users" ON "projects"."id" = "projects_users"."project_id" WHERE "projects_users"."user_id" = $1  [["user_id", 2]]

    def projects_length
        @projects_length=current_user.projects.count
---
SELECT COUNT(*) FROM "projects" INNER JOIN "projects_users" ON "projects"."id" = "projects_users"."project_id" WHERE "projects_users"."user_id" = $1  [["user_id", 2]]