app/controllers/tasks_controller.rb

    def create
        @task = @project.tasks.create!(task_params)
---
INSERT INTO "tasks" ("project_id", "description", "source", "difficulty") VALUES ($1, $2, $3, $4) RETURNING "id"  [["project_id", 16], ["description", "add something somewhere"], ["source", "react"], ["difficulty", 5]]

    def update
        @task.update(task_params)
---
UPDATE "tasks" SET "source" = $1 WHERE "tasks"."id" = $2  [["source", "react-rails"], ["id", 81]]