app/models/project.rb

    def time_spent
        if self.activities
            self.activities.all.sum(:time_spent)
---
SELECT SUM("activities"."time_spent") FROM "activities" WHERE "activities"."project_id" = $1  [["project_id", 16]]

    def points
        if self.tasks
            self.tasks.sum(:difficulty)
---
SELECT SUM("tasks"."difficulty") FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 16]]