app/models/user.rb

    def invalidate_token
        self.update_columns(auth_token: nil)
---
UPDATE "users" SET "auth_token" = $1 WHERE "users"."id" = $2  [["auth_token", nil], ["id", 2]]